In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({
    'Name': ["Anna", "Karen", "John", "Alice", "Kevin", "Sanna", "Bob", "Emily"],
    'Age': [35, 30, 57, 65, 25, 19, 20, 65],
    'Salary': [20000, 60000, 145000, 170000, 30000, 10000, 220000, 120000],
    'Department': ['Tech', 'Tech', 'Tech', 'Healthcare', 'Operations', 'Operations', 'Tech', 'Tech']
})
data

    Name  Age  Salary  Department
0   Anna   35   20000        Tech
1  Karen   30   60000        Tech
2   John   57  145000        Tech
3  Alice   65  170000  Healthcare
4  Kevin   25   30000  Operations
5  Sanna   19   10000  Operations
6    Bob   20  220000        Tech
7  Emily   65  120000        Tech

In [3]:
data.sort_values("Salary")

    Name  Age  Salary  Department
5  Sanna   19   10000  Operations
0   Anna   35   20000        Tech
4  Kevin   25   30000  Operations
1  Karen   30   60000        Tech
7  Emily   65  120000        Tech
2   John   57  145000        Tech
3  Alice   65  170000  Healthcare
6    Bob   20  220000        Tech

In [4]:
data.sort_values("Salary", ascending=False)

    Name  Age  Salary  Department
6    Bob   20  220000        Tech
3  Alice   65  170000  Healthcare
2   John   57  145000        Tech
7  Emily   65  120000        Tech
1  Karen   30   60000        Tech
4  Kevin   25   30000  Operations
0   Anna   35   20000        Tech
5  Sanna   19   10000  Operations

In [5]:
data.groupby("Department").count()

            Name  Age  Salary
Department
Healthcare     1    1       1
Operations     2    2       2
Tech           5    5       5

In [6]:
data.groupby("Department")["Name"].count()

Department
Healthcare    1
Operations    2
Tech          5
Name: Name, dtype: int64

In [7]:
data.groupby("Department")["Salary"].mean()

Department
Healthcare    170000.0
Operations     20000.0
Tech          113000.0
Name: Salary, dtype: float64

In [8]:
data.groupby("Department")["Salary"].min()

Department
Healthcare    170000
Operations     10000
Tech           20000
Name: Salary, dtype: int64

In [9]:
data.groupby("Department")["Salary"].max()

Department
Healthcare    170000
Operations     30000
Tech          220000
Name: Salary, dtype: int64

In [10]:
data.groupby("Department")["Age"].mean()

Department
Healthcare    65.0
Operations    22.0
Tech          41.4
Name: Age, dtype: float64

In [11]:
data[data["Salary"] > 100000]

    Name  Age  Salary  Department
2   John   57  145000        Tech
3  Alice   65  170000  Healthcare
6    Bob   20  220000        Tech
7  Emily   65  120000        Tech

In [12]:
data[(data["Salary"] > 100000) & (data["Salary"] < 200000)]

    Name  Age  Salary  Department
2   John   57  145000        Tech
3  Alice   65  170000  Healthcare
7  Emily   65  120000        Tech

In [13]:
data[data["Age"].isin([20, 65])]

    Name  Age  Salary  Department
3  Alice   65  170000  Healthcare
6    Bob   20  220000        Tech
7  Emily   65  120000        Tech